//==========================Нужные данные для использования печатной формы как внещней в УФ
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура();
	
	МассивНазначений = Новый Массив;
	//МассивНазначений.Добавить("Справочник.Сотрудники"); //Указываем документ к которому делаем внешнюю печ. форму
	
	
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка"); //варианты: «ДополнительнаяОбработка», «ДополнительныйОтчет», «ЗаполнениеОбъекта», «Отчет», «ПечатнаяФорма» или «СозданиеСвязанныхОбъектов»
	ПараметрыРегистрации.Вставить("Наименование", "Проверка работы соединений");//имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "v1.4");
	ПараметрыРегистрации.Вставить("Информация", "Обработка ""Проверка работы соединений""");
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Табл.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));//имя макета печ.формы
	Табл.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));//ВызовСерверногоМетода
	Табл.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Табл.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	НовСтрока = Табл.Добавить();
	НовСтрока.Представление = "Проверка работы соединений";//как форма будет написана в меню вызова для работы
	НовСтрока.Идентификатор = "ПроверкаРаботыСоединений"; //Имя печатаемого макета
	НовСтрока.Использование = "ОткрытиеФормы";//Варианты "ВызовКлиентскогоМетода", "ВызовСерверногоМетода", "ОткрытиеФормы"
	НовСтрока.Модификатор = "ПечатьMXL";
	
	ПараметрыРегистрации.Вставить("Команды", Табл);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
